---
type: IPipeFittingAndAccessoryPressureDropUIServer
namespace: Autodesk.Revit.UI.Plumbing
version: 2024
members: 2
tags: [revit-api, class]
---

# IPipeFittingAndAccessoryPressureDropUIServer

`Autodesk.Revit.UI.Plumbing.IPipeFittingAndAccessoryPressureDropUIServer` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetDBServerId | 2014 | `Guid GetDBServerId ()` |
| Method | ShowSettings | 2014 | `bool ShowSettings ( PipeFittingAndAccessoryPressureDropUIData data )` |